app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY updated_at DESC
---
  def index
    @posts = Post.all.order('updated_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "bjjhjjj"], ["updated_at", "2020-06-15 15:41:39.489924"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)